
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "demo_nat_gw_eip"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all             = {
          + "Name"        = "demo_nat_gw_eip"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc                  = (known after apply)
    }

  # aws_instance.appserver will be created
  + resource "aws_instance" "appserver" {
      + ami                                  = "ami-005fc0f236362e99f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (sensitive value)
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"        = "demo_appserver"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all                             = {
          + "Name"        = "demo_appserver"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "980eaf0431f99dc69741cb8c37cfce65e4e67917"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-005fc0f236362e99f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (sensitive value)
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"        = "demo_bastion"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all                             = {
          + "Name"        = "demo_bastion"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "980eaf0431f99dc69741cb8c37cfce65e4e67917"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "demo_ig"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all = {
          + "Name"        = "demo_ig"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_main_route_table_association.this will be created
  + resource "aws_main_route_table_association" "this" {
      + id                      = (known after apply)
      + original_route_table_id = (known after apply)
      + route_table_id          = (known after apply)
      + vpc_id                  = (known after apply)
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "demo_nat_gw"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all                           = {
          + "Name"        = "demo_nat_gw"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
    }

  # aws_route_table.main will be created
  + resource "aws_route_table" "main" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo_main_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "demo_main_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo_private_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "demo_private_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo_public_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "demo_public_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_security_group.appserver will be created
  + resource "aws_security_group" "appserver" {
      + arn                    = (known after apply)
      + description            = "Demo security group for application server"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "appserver_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "demo_appserver_sg"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "demo_appserver_sg"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Demo security group for bastion"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bastion_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "demo_bastion_sg"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "demo_bastion_sg"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.appserver_allow_inbound_ssh_from_bastion will be created
  + resource "aws_security_group_rule" "appserver_allow_inbound_ssh_from_bastion" {
      + description              = "SSH ingress"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_security_group_rule.appserver_allow_outbound_http_to_all will be created
  + resource "aws_security_group_rule" "appserver_allow_outbound_http_to_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP egress"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # aws_security_group_rule.appserver_allow_outbound_https_to_all will be created
  + resource "aws_security_group_rule" "appserver_allow_outbound_https_to_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS egress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.appserver_allow_outbound_icmp_to_all will be created
  + resource "aws_security_group_rule" "appserver_allow_outbound_icmp_to_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "ICMP egress"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_allow_inbound_ssh_from_admin_ip will be created
  + resource "aws_security_group_rule" "bastion_allow_inbound_ssh_from_admin_ip" {
      + cidr_blocks              = [
          + "40.76.181.124/32",
        ]
      + description              = "SSH ingress"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_security_group_rule.bastion_allow_outbound_ssh_to_appserver will be created
  + resource "aws_security_group_rule" "bastion_allow_outbound_ssh_to_appserver" {
      + description              = "SSH egress"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "demo_vpc"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all                             = {
          + "Name"        = "demo_vpc"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
    }

  # module.private_subnet["10.0.240.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_subnet["10.0.240.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.240.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.private_subnet["10.0.250.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_subnet["10.0.250.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.250.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnet["10.0.10.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_subnet["10.0.10.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnet["10.0.20.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_subnet["10.0.20.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

Plan: 26 to add, 0 to change, 0 to destroy.